SAY "DIAGNOSTICO DE MEMORIA EM EXECUCAO..."

ADDRESS SDSF "ISFEXEC CMD '/D M=STOR'"
ADDRESS SDSF "ISFEXEC CMD '/D M=REAL'"
ADDRESS SDSF "ISFEXEC CMD '/D M=CSA'"
ADDRESS SDSF "ISFEXEC CMD '/D ASM,ALL'"
ADDRESS SDSF "ISFEXEC CMD '/D A,L'"

SAY "COLETA FINALIZADA"