<<<<<<< HEAD:Workbook/Source 22 ´- Storage/script039.rexx
<<<<<<< HEAD
/* rexx */

/* Ver status do Sysplex */

ADDRESS TSO "CONSOLE 'D XCF,SUMMARY'"
=======
/* rexx */
>>>>>>> 82b737d8c784b4ee22d7b8dd131fae340054bee3
=======
/* rexx */
>>>>>>> 45622025cdda253030ca8bbfffd9127509ad81ff:Workbook/Source 22 ´- Storage/script040.rexx
