<<<<<<< HEAD
/* rexx */

/* Ver status do Sysplex */

ADDRESS TSO "CONSOLE 'D XCF,SUMMARY'"
=======
/* rexx */
>>>>>>> 82b737d8c784b4ee22d7b8dd131fae340054bee3
