/* rexx */

/* HEALTH CHECK */

ADDRESS TSO "CONSOLE 'D M=STOR'"
ADDRESS TSO "CONSOLE 'D ASM'"
ADDRESS TSO "CONSOLE 'D U,DASD'"
ADDRESS TSO "CONSOLE 'D A'"
ADDRESS TSO "CONSOLE 'D WLM'"
