ADDRESS SDSF "ISFEXEC CMD '/D M=STOR'"
ADDRESS SDSF "ISFEXEC CMD '/D M=REAL'"
ADDRESS SDSF "ISFEXEC CMD '/D M=CSA'"
ADDRESS SDSF "ISFEXEC CMD '/D ASM,ALL'"