/* REXX */

/* ERRO APONTANDO O LOCAL DO ERRO */

SIGNAL ON ERROR

A = 10 / 0        /* GERA ERRO */

RETURN

ERROR:
SAY "ERRO NA LINHA:" SIGL
EXIT 12
