/* REXX */
/* EXEMPLO VARRER TODO O SPOOL */

ADDRESS SDSF
"ISFEXEC ST"

DO J = 1 TO ISFROWS
   SAY "JOB:" ISFJOBNAME.J ISFJOBID.J ISFSTATUS.J

   ADDRESS SDSF
   ISFJOBID = ISFJOBID.J
   "ISFEXEC O"

   DO D = 1 TO ISFROWS
      SAY "  DD:" ISFDDNAME.D ISFLINECT.D "LINHAS"
   END
END
