/* REXX */
/* COMO ATIVAR COMANDOS SDSF EM UM EXEC REXX VIA TSO */



ADDRESS TSO "SUBCOM SDSF"

IF RC <> 0 THEN DO
   ADDRESS TSO "SDSF"   /* CARREGA O AMBIENTE */
   IF RC <> 0 THEN DO
      SAY "ERRO AO INICIALIZAR SDSF"
      EXIT 16
   END
END
