/*REXX*/
/*                                                     */
/* exemplo de funcao time() hora do sistema            */
/*                                                     */

HORA = TIME()

Say 'Ola Mundo, horario = '||HORA
