 /* REXX */
 DSN = "'KC02746.DATASET.TESTE'"

 ADDRESS TSO "ALLOC DA("DSN") NEW SPACE(1,1) TRACKS",
             "LRECL(80) RECFM(F,B) DSORG(PS)"

 SAY "DATASET CRIADO: " DSN
 EXIT
