/* REXX */
/* PURGE VIA JES2 CONSOLE             */
/* FUNCIONA EM QUALQUER Z/OS COM JES2 */

PARSE ARG JOBID .

IF JOBID = "" THEN DO
   SAY "USO: %PURGEJ JOB12345"
   EXIT 8
END

/* ENVIA COMANDO DIRETO AO JES2 */
CMD = "$PJ "JOBID

ADDRESS CONSOLE CMD
RCCMD = RC

IF RCCMD = 0 THEN
  SAY "PURGE ENVIADO AO JES2 PARA "JOBID
ELSE
  SAY "FALHA AO ENVIAR COMANDO. RC="RCCMD

EXIT RCCMD
