/* REXX */

ADDRESS TSO
"SUBCOM SDSF"
SAY "SUBCOM RC="RC

IF RC <> 0 THEN DO
   "SDSF"
   SAY "ATIVANDO SDSF RC="RC
END

ADDRESS SDSF
"ISFEXEC STATUS"
SAY "ISFEXEC RC="RC

/* LISTAR APENAS MEUS JOBS */
ADDRESS SDSF

ISFOWNER = USERID()     /* FILTRA DIRETO! */

"ISFEXEC ST"

IF RC <> 0 THEN DO
  SAY "ERRO: ISFEXEC ST RC="RC
  EXIT RC
END

DO I = 1 TO ISFROWS
   SAY ISFJOBNAME.I ISFJOBID.I ISFSTATUS.I
END

