/* REXX */
/* LISTAR DDS DO SDSF O PARA UM JOB */

JOBID = "JOB12345"

ADDRESS SDSF

ISFJOBID = JOBID

"ISFEXEC DA"      /* DA = DISPLAY ALL (DDS) */

IF RC <> 0 THEN DO
  SAY "ERRO ISFEXEC DA RC="RC
  EXIT
END

SAY "=== DDS DO JOB "JOBID" ==="

DO I = 1 TO ISFROWS
   SAY LEFT(ISFDDNAME.I,12) "  " ISFDDNUM.I "  " ISFLINECT.I " LINHAS"
END
