/*REXX*/
/*                                                     */
/* exemplo de call                                     */
/*                                                     */

Say 'Um exemplo de REXX chamando outro EXEC'

TSO EX 'ADCDMST.LIB.REXX(REXX0001)'

