/*REXX*/

/* REXX EXEC TO INTRODUCE REXX */
SAY "HELLO! MY NAME IS REXX. WHAT'S YOURS?"

PARSE PULL NAME

IF NAME = '' THEN
 SAY "YOU'RE NOT VERY FRIENDLY."
ELSE
 SAY NAME "IS A NICE NAME."

EXIT 0
