/* REXX */
/* LISTAR JOBS QUE COME«AM COM TEST */

ADDRESS SDSF

ISFOWNER = "*"         /* PEGA GERAL */

ISFJOBNAME = "TEST*"   /* FILTRO */
"ISFEXEC ST"

IF RC = 0 THEN DO
   DO I = 1 TO ISFROWS
      SAY ISFJOBNAME.I ISFJOBID.I ISFSTATUS.I
   END
END
ELSE
   SAY "ERRO RC="RC

