/* REXX */

/* PUSH + QUEUE MISTURADOS    */

QUEUE 'PRIMEIRO'
QUEUE 'SEGUNDO'
PUSH  'TERCEIRO'

PARSE PULL A
PARSE PULL B
PARSE PULL C

SAY A
SAY B
SAY C
