/* REXX */
/* LIFO - LAST IN, FIRST OUT */

PUSH 'PRIMEIRO'
PUSH 'SEGUNDO'
PUSH 'TERCEIRO'

PARSE PULL X1
PARSE PULL X2
PARSE PULL X3

SAY X1
SAY X2
SAY X3
