/* rexx */

ADDRESS TSO

CALL RXFUNCADD 'SYSLOAD','REXXUTIL','SYSLOAD'
CALL SYSLOAD

file = STREAM('KC02746.ALUNOS.EXRC2.TESTE','C','OPEN READ')

DO WHILE LINES(file) > 0
  line = LINEIN(file)
  SAY line
END

CALL STREAM file,'C','CLOSE'

