/* rexx */

/* STREAM I/O Ler arquivo linha a linha */

ADDRESS TSO

/* Carregar fun«íes do REXXUTIL */
CALL RXFUNCADD 'SYSLOAD','REXXUTIL','SYSLOAD'
CALL SYSLOAD

file = Stream('KC02746.ALUNOS.EXRC2.TESTE','C','OPEN READ')

Do While Lines(file)
  line = Linein(file)
  Say line
End

Call Stream file,'C','CLOSE'

