/* REXX */

/* FIFO - FIRST IN, FIRST OUT */

QUEUE 'PRIMEIRO'
QUEUE 'SEGUNDO'
QUEUE 'TERCEIRO'

PARSE PULL X1
PARSE PULL X2
PARSE PULL X3

SAY X1
SAY X2
SAY X3
