/*REXX*/
/*                                        */
/* exeplo de variavel e input de variavel */
/* pull captura valores da tela           */
/*                                        */
say 'Digite seu nome'

pull nome

say ' '
say ' '
say ' '
say 'Ola cara colega ' || nome
