/* REXX */

/* CAPTURA ERRO E EXIBE NUMERO DE LINHA */

SIGNAL ON ERROR

/* CÏDIGO... */
X = UNKNOWNVAR + 1  /* ERRO DELIBERADO */

EXIT 0

ERROR:
SAY "O ERRO OCORREU NA LINHA:" SIGL
SAY "CÏDIGO DE RETORNO DO ERRO:" RC
EXIT 12

