/* REXX */

/* REXX   EXECNAME: PROPOSITO, AUTOR, HISTORICO */

SIGNAL ON NOVALUE
SIGNAL ON ERROR
ADDRESS TSO

PARSE SOURCE . . SRCFILE .

/* MAIN */
CALL INIT
CALL LOGIC
CALL FINISH
EXIT 0

/* ------------------------ */
INIT: PROCEDURE EXPOSE GLOBAL.*
 SAY 'HELLO'
RETURN

ERROR:
    SIGNAL OFF ERROR
    SAY "FAILED... RC=" RC
    EXIT 20
