/* REXX */

/* EXEMPLO 1: ANaLISE SIMPLES POR PALAVRAS */

MINHASTRING = "CONHECIMENTO eh PODER."

PARSE VAR MINHASTRING PALAVRA1 PALAVRA2 PALAVRA3

SAY "PALAVRA 1:" PALAVRA1  /* SAIDA: PALAVRA 1: CONHECIMENTO */
SAY "PALAVRA 2:" PALAVRA2  /* SAIDA: PALAVRA 2: EH */
SAY "PALAVRA 3:" PALAVRA3  /* SAIDA: PALAVRA 3: PODER. */
