/* REXX */
/* EXIBE SDSF O */

JOBID = "JOB12345"

ADDRESS SDSF
ISFJOBID = JOBID

"ISFEXEC O"
IF RC <> 0 THEN EXIT RC

SAY "=== OUTPUT DO JOB "JOBID" ==="

DO I = 1 TO ISFROWS
   SAY ISFDDNAME.I ISFDDNUM.I ISFLINECT.I "LINHAS"
END

