/* rexx */

IF score >90 then
health='Healthy'


IF score >80 then
health='Good'


IF score >70 then
health='Warning'


IF score >50 then
health='Critical'


IF score <=50 then
health='Emergency'
