/* REXX */
/* Atualiza informações de um registro existente. Muito utilizado para correções operacionais e manutenção de dados. */

ADDRESS IMS

"GHU CLIENTE CODCLI=2001"

IF RC = 0 THEN
DO

   "REPL CLIENTE LIMITE=15000"

END