/* rexx */

/* Exemplo de programa REXX (MEUEXEC.REXX) */
PARSE ARG arg1, arg2, arg3  /* Recebe at© 3 argumentos */
SAY "Argumento 1 recebido: " || arg1
SAY "Argumento 2 recebido: " || arg2
SAY "Argumento 3 recebido: " || arg3
