/* REXX */

/* GRAVA LOG DE ERRO */

CALL LOG 'ANTES DA LINHA 40'

/* ... CÏDIGO ... */

LOG:
  CALL LINEOUT 'KC02746.WORKBOOK.REXX(LOG)', ARG(1)
RETURN

