/*REXX*/
/*                                                     */
/* Exemplo de uso de variaveis                         */
/*                                                     */

CAMPO = 'HELLO WORD'

SAY 'CAMPO='CAMPO

EXIT 2
