/*REXX*/
/*                                                     */
/* exemplo de calculo e formula                        */
/*                                                     */

total = 10 * 2.5

SAY 'Seu cuto total eh $'||total||'.'

desconto = (total * ( 10 / 100) )

SAY 'Seu desconto eh $'||desconto||"."

valor = total - desconto

SAY 'Valor a pagar eh $'||valor||"."

