/* REXX */

DSN = "'KC02746.DATASET.TESTE'"
DDN = "OUT"

S.1 = "LINHA 1"
S.2 = "LINHA 2"
S.0 = 2

/* ALOCA O DATASET */
ADDRESS TSO "ALLOC F("DDN") DA("DSN") SHR REUSE"

/* ESCREVE */
ADDRESS TSO "EXECIO "S.0" DISKW "DDN" (STEM S. FINIS)"

WRC = RC

IF WRC = 0 THEN
    SAY "GRAVADO EM " DSN
ELSE DO
    SAY "ERRO AO GRAVAR, RC=" WRC
END

/* LIBERA */
ADDRESS TSO "FREE F("DDN")"

EXIT

EXIT
