/*REXX*/
/*                                                     */

/* atencao mainframe usa o EBCDIC logo ira converter para maiuscula */
/* O que você digitar como sua idade será convertido em letras      */
/* maiúsculas                                                       */

/* o mesmo que acima, mas a entrada não é convertida para maiúsculas */
say ' Digite um nome : '

Pull nome1

say nome1

say ' '

say ' Digite outro nome : '

Parse Pull nome

say nome

