/* REXX */
/* LER CONTE£DO DE UM DD SDSF */

JOBID   = "JOB12345"
DDNAME  = "JESMSGLG"

ADDRESS SDSF

ISFJOBID = JOBID
ISFDDNAME = DDNAME

"ISFEXEC UL"      /* UL = OUTPUT LINES */

IF RC <> 0 THEN DO
  SAY "ERRO ISFEXEC UL RC="RC
  EXIT
END

SAY "=== CONTE§DO DO DD: "DDNAME" ==="
DO I = 1 TO ISFULINE.0
   SAY ISFULINE.I
END
