/* REXX */
/* PURGE AUTOMêTICO SEM CONFIRMACAO */

PARSE ARG ID .
IF ID = "" THEN DO
   SAY "USO:  %PURGEAUTO  JOB12345  OU  JOBNAME"
   EXIT 8
END

/* ATIVAR SDSF (MODO COMANDO) */
ADDRESS TSO "SDSF"

/* IR PARA O PAINEL ST (STATUS) */
ADDRESS SDSF "ST"

/* FILTRAR PELO JOB INFORMADO */
ADDRESS SDSF "PREFIX "ID
ADDRESS SDSF "OWNER *"

/* EXECUTA PURGE DIRETAMENTE */
ADDRESS SDSF "P "ID

SAY "PURGE SOLICITADO PARA: "ID

EXIT 0
