/* REXX */
say "Digite dois números:"
parse pull a b

say "Você digitou:" a "e" b

say a "+" b "=" a + b
say a "-" b "=" a - b
say a "*" b "=" a * b
say a "/" b "=" a / b

say a "dividido por" b "é" a % b "resto" a // b